# HasDoubleWallConnector Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConnectorInfo..::..HasDoubleWallConnector Method
FabricationConnectorInfo Class See Also
---
Checks if there are any double wall connectors fabricated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool HasDoubleWallConnector()
```

Visual Basic
---
```text
Public Function HasDoubleWallConnector As Boolean
```

Visual C++
---
```text
public:
bool HasDoubleWallConnector()
```

# ### Return Value
True if there are any double wall connectors fabricated.
# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace